In [2]:
import pandas as pd

# Series

In [4]:
pd.Series( [1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index_s = ['a', 'b', 'c', 'd','e']
ser = pd.Series( [1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
ser[0], ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_17356\1772165095.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a']

(np.int64(1), np.int64(1))

In [8]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
print(s3)

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
ser2 = pd.Series([10, 'banana'])
type(ser2), ser2

(pandas.core.series.Series,
 0        10
 1    banana
 dtype: object)

In [ ]:
population = pd.Series([ 9776, 2729, 1566, 3158], 
                       index=['서울', '부산', '인천', '대구'])
population['서울']
population[['서울', '부산']] #0,1  팬시인덱싱

서울    9776
부산    2729
dtype: int64

In [16]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [19]:
#ser[0], ser['a']
ser.iloc[0], ser.loc['a']

(np.int64(1), np.int64(1))

# DataFrame

In [20]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

```
iloc[] : indexlocator
loc[] : locator
```

In [21]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [29]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object')

In [23]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [24]:
scientists['Name']

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [26]:
scientists.index = ['Rosaline Franklin', 'William Gosset']

In [27]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [28]:
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [30]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [32]:
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [31]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [33]:
sci1.loc[0,'Name']

'Rosaline Franklin'

In [ ]:
sci1.to_csv('./data/scientist_1.csv')

In [36]:
sci1.to_csv('./data/scientist_2.csv', index=False)

In [37]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [38]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician